Blood_Flow/Blood_Flow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Inlet
    {
      type	uniformFixedValue;
      uniformValue	sine;
      uniformValueCoeffs
        {
            frequency 1.33;
            amplitude 0.2;
            scale     (0 0 0);
            level     (0 0 -1); // offset
            t0  0; // shift this for a Cosinus
        }
    }

    Outlet
    {
        type		zeroGradient;
    }

    Wall
    {
        type            noSlip;
    }

}

// ************************************************************************* //
