Blood_Flow/Blood_Flow/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    Outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          324;
        startFace       163476;
    }
    Inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          324;
        startFace       163800;
    }
    Wall
    {
        type            patch;
        physicalType    patch;
        nFaces          6300;
        startFace       164124;
    }
)

// ************************************************************************* //
