Blood_Flow/Blood_Flow/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
default         Euler;
}
gradSchemes
{
default         Gauss linear;
grad(p)         leastSquares;
}
divSchemes
{
default         none;
div(phi,U)      Gauss linear;
}
laplacianSchemes
{
default         Gauss linear corrected;
}
interpolationSchemes
{
default         linear;
}
snGradSchemes
{
default         corrected;
}
fluxRequired
{
default         no;
p               ;
}

// ************************************************************************* //
