Blood_Flow/Blood_Flow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
p
	{
	solver          GAMG;
	tolerance       1e-05;
	relTol          0.1;
	smoother        GaussSeidel;
	nPreSweeps      0;
	nPostSweeps     2;
	cacheAgglomeration true;
	nCellsInCoarsestLevel 10;
	agglomerator    faceAreaPair;
	mergeLevels     1;
	}
pFinal
    {
        $p;
        relTol          0;
    }
U
	{
		solver          smoothSolver;
		smoother        GaussSeidel; //symGaussSeidel;
		tolerance       1e-05;
		relTol          0;
	}
}
PISO
{
nCorrectors     4;
nNonOrthogonalCorrectors 2;
}




// ************************************************************************* //
